In [1]:
import pandas as pd
import numpy as np
from pydataset import data
from env import host, username, password

In [2]:
def get_db_url(host, username, password, database):
    return f'mysql+pymysql://{username}:{password}@{host}/{database}'
url = get_db_url(host, username, password, 'employees')

In [3]:
df = pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
df

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

## Exercises Part 1:

Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)
cd into your exercises folder for this module and run echo env.py >> .gitignore
Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

Use your function to obtain a connection to the employees database.

In [4]:
#Done

1. Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

In [5]:
#url = f'mysql+=pymysql://{username}:{password}@{host}/employees'
#df = pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
#ArgumentError

b. Intentionally make an error in your SQL query. What does the error message look like?

In [6]:
#query = 'SELECT all FROM employees LIMIT 5 OFFSET 50'

#df_sql = pd.read_sql(query, url)
#df_sql
#ProgrammingError: "You have an error in your SQL syntax;..."

Read the employees and titles tables into two separate DataFrames.

In [7]:
query = "SELECT * FROM employees;"
query2 = "SELECT * FROM titles;"
employees_table = pd.read_sql(query, url)
titles_table = pd.read_sql(query2, url)

How many rows and columns do you have in each DataFrame? Is that what you expected?

In [8]:
employees_table.shape

(300024, 6)

In [9]:
titles_table.shape

(443308, 4)

Display the summary statistics for each DataFrame.

In [10]:
employees_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [11]:
titles_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

How many unique titles are in the titles DataFrame?

In [12]:
titles_table.value_counts()
titles_table.nunique() #counts number of unique()
titles_table['title'].unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [13]:
employees_table.value_counts()

emp_no  birth_date  first_name  last_name     gender  hire_date
10001   1953-09-02  Georgi      Facello       M       1986-06-26    1
299980  1953-05-26  Marsal      Lovengreen    M       1988-05-09    1
299996  1958-10-19  Georg       Peck          M       1990-11-21    1
299995  1960-05-30  Arfst       Ertl          M       1990-05-27    1
299994  1963-05-31  Marjo       Ruemmler      M       1985-02-25    1
                                                                   ..
110344  1961-09-07  Rosine      Cools         F       1985-11-22    1
110303  1956-06-08  Krassimir   Wegerle       F       1985-01-01    1
110228  1958-12-02  Karsten     Sigstam       F       1985-08-04    1
110183  1953-06-24  Shirish     Ossenbruggen  F       1985-01-01    1
499999  1958-05-01  Sachin      Tsukuda       M       1997-11-30    1
Length: 300024, dtype: int64

What is the oldest date in the to_date column?

In [14]:
titles_table.sort_values(by='to_date').head(1)

       emp_no     title   from_date     to_date
16064   20869  Engineer  1985-02-17  1985-03-01

What is the most recent date in the to_date column?

In [15]:
titles_table.sort_values(by=['to_date', 'from_date']).tail(1)

        emp_no         title   from_date     to_date
436755  495525  Senior Staff  2002-08-01  9999-01-01

## Exercises Part 2:

1. Copy the users and roles DataFrames from the examples above.

In [16]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [17]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

2. What is the result of using a right join on the DataFrames?

In [18]:
users.merge(roles, left_on='role_id', right_on='id', how='right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

3. What is the result of using an outer join on the DataFrames?

In [19]:
users.merge(roles, left_on='role_id', right_on='id', how='outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [20]:
(users.merge(roles, left_on='role_id', right_on='id', how='outer').
 drop(columns=['role_id', 'id_y']).
 rename(columns={'id_x':'id', 'name_x':'employee','name_y':'role'}))

    id employee       role
0  1.0      bob      admin
1  2.0      joe     author
2  3.0    sally   reviewer
3  4.0     adam   reviewer
4  5.0     jane        NaN
5  6.0     mike        NaN
6  NaN      NaN  commenter

5. Load the mpg dataset from PyDataset.

In [21]:
mpg=data('mpg')

6. Output and read the documentation for the mpg dataset.

In [22]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

7. How many rows and columns are in the dataset?

In [23]:
mpg.shape

(234, 11)

8. Check out your column names and perform any cleanup you may want on them.

In [24]:
mpg = mpg.rename(columns={'cty':'city'}) # What is 'fl'? show_doc does not say. 'p','r','d'
mpg.sample(10)

,manufacturer,model,displ,year,cyl,trans,drv,city,hwy,fl,class
115,hyundai,sonata,3.3,2008,6,auto(l5),f,19,28,r,midsize
106,honda,civic,1.8,2008,4,auto(l5),f,25,36,r,subcompact
122,hyundai,tiburon,2.7,2008,6,manual(m5),f,17,24,r,subcompact
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize
68,dodge,ram 1500 pickup 4wd,4.7,2008,8,auto(l5),4,13,17,r,pickup
62,dodge,durango 4wd,5.2,1999,8,auto(l4),4,11,16,r,suv
97,ford,mustang,4.6,2008,8,manual(m5),r,15,23,r,subcompact
25,chevrolet,corvette,5.7,1999,8,auto(l4),r,15,23,p,2seater
229,volkswagen,passat,1.8,1999,4,auto(l5),f,18,29,p,midsize
48,dodge,caravan 2wd,4.0,2008,6,auto(l6),f,16,23,r,minivan

9. Display the summary statistics for the dataset.

In [25]:
mpg.describe().round(2)

        displ     year     cyl    city     hwy
count  234.00   234.00  234.00  234.00  234.00
mean     3.47  2003.50    5.89   16.86   23.44
std      1.29     4.51    1.61    4.26    5.95
min      1.60  1999.00    4.00    9.00   12.00
25%      2.40  1999.00    4.00   14.00   18.00
50%      3.30  2003.50    6.00   17.00   24.00
75%      4.60  2008.00    8.00   19.00   27.00
max      7.00  2008.00    8.00   35.00   44.00

10. How many different manufacturers are there?

In [26]:
len(mpg.value_counts('manufacturer'))

15

11. How many different models are there?

In [27]:
len(mpg.value_counts('model'))

38

12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [28]:
mpg['mileage_difference'] = (mpg['hwy'] - mpg['city'])
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,city,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [29]:
mpg['average_mileage'] = round((mpg['hwy'] + mpg['city'])/2,2)
mpg.sample(10)

,manufacturer,model,displ,year,cyl,trans,drv,city,hwy,fl,class,mileage_difference,average_mileage
221,volkswagen,jetta,2.8,1999,6,manual(m5),f,17,24,r,compact,7,20.5
14,audi,a4 quattro,3.1,2008,6,auto(s6),4,17,25,p,compact,8,21.0
75,ford,expedition 2wd,4.6,1999,8,auto(l4),r,11,17,r,suv,6,14.0
202,toyota,toyota tacoma 4wd,2.7,1999,4,auto(l4),4,16,20,r,pickup,4,18.0
133,land rover,range rover,4.4,2008,8,auto(s6),4,12,18,r,suv,6,15.0
210,volkswagen,gti,2.0,2008,4,manual(m6),f,21,29,p,compact,8,25.0
47,dodge,caravan 2wd,3.8,2008,6,auto(l6),f,16,23,r,minivan,7,19.5
151,nissan,pathfinder 4wd,3.3,1999,6,auto(l4),4,14,17,r,suv,3,15.5
174,toyota,4runner 4wd,2.7,1999,4,manual(m5),4,15,20,r,suv,5,17.5
61,dodge,durango 4wd,4.7,2008,8,auto(l5),4,13,17,r,suv,4,15.0

14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [30]:
mpg['is_automatic'] = mpg['trans'].str.contains('auto')
mpg.sample(10)

,manufacturer,model,displ,year,cyl,trans,drv,city,hwy,fl,class,mileage_difference,average_mileage,is_automatic
29,chevrolet,k1500 tahoe 4wd,5.3,2008,8,auto(l4),4,14,19,r,suv,5,16.5,True
74,dodge,ram 1500 pickup 4wd,5.9,1999,8,auto(l4),4,11,15,r,pickup,4,13.0,True
43,dodge,caravan 2wd,3.3,2008,6,auto(l4),f,17,24,r,minivan,7,20.5,True
206,toyota,toyota tacoma 4wd,4.0,2008,6,manual(m6),4,15,18,r,pickup,3,16.5,False
110,hyundai,sonata,2.4,1999,4,manual(m5),f,18,27,r,midsize,9,22.5,False
183,toyota,camry,2.4,2008,4,auto(l5),f,21,31,r,midsize,10,26.0,True
103,honda,civic,1.6,1999,4,manual(m5),f,23,29,p,subcompact,6,26.0,False
173,subaru,impreza awd,2.5,2008,4,manual(m5),4,20,27,r,compact,7,23.5,False
61,dodge,durango 4wd,4.7,2008,8,auto(l5),4,13,17,r,suv,4,15.0,True
30,chevrolet,k1500 tahoe 4wd,5.3,2008,8,auto(l4),4,11,14,e,suv,3,12.5,True

15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [31]:
mpg.groupby('manufacturer').agg('mean').sort_values('average_mileage').tail(1)
#mpg.groupby('manufacturer')['average_mileage'].agg('mean') #Adam's answer.

,displ,year,cyl,city,hwy,mileage_difference,average_mileage,is_automatic
manufacturer,,,,,,,,
honda,1.711111,2003.0,4.0,24.444444,32.555556,8.111111,28.5,0.444444

16. Do automatic or manual cars have better miles per gallon?

In [32]:
mpg.groupby('is_automatic')['average_mileage'].agg('mean')

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

## Exercises Part 3:

1. Use your get_db_url function to help you explore the data from the chipotle database.

In [33]:
def get_db_url(host, username, password, database):
    return f'mysql+pymysql://{username}:{password}@{host}/{database}'
url = get_db_url(host, username, password, 'chipotle')

In [34]:
query_chipotle = "SELECT * FROM orders;"
chipotle_db = pd.read_sql(query_chipotle, url)

In [35]:
chipotle_db.sample(10)

,id,order_id,quantity,item_name,choice_description,item_price
514,515,215,1,Chips and Guacamole,nan,$4.45
3689,3690,1478,2,Chicken Burrito,"[Roasted Chili Corn Salsa (Medium), [Sour Cream, Cheese, Black Beans, Rice]]",$16.98
4274,4275,1704,1,Chips and Guacamole,nan,$4.45
1824,1825,737,2,Chips and Guacamole,nan,$8.90
174,175,78,1,Chicken Burrito,"[Tomatillo-Green Chili Salsa (Medium), Lettuce]",$8.49
2496,2497,991,1,Chips,nan,$2.15
2545,2546,1009,1,Bottled Water,nan,$1.09
1058,1059,436,1,Chicken Bowl,"[[Fresh Tomato Salsa (Mild), Tomatillo-Red Chili Salsa (Hot)], [Black Beans, Rice, Che...",$8.49
3569,3570,1432,1,Steak Soft Tacos,"[Fresh Tomato Salsa, [Cheese, Lettuce]]",$9.25
2722,2723,1081,1,Chicken Burrito,"[Roasted Chili Corn Salsa, [Rice, Pinto Beans, Cheese, Sour Cream, Lettuce]]",$8.75

In [36]:
chipotle_db['item_price'].str.contains(',').sum()

0

In [37]:
chipotle_db['item_price'] = chipotle_db['item_price'].str.replace('$','').astype('float')

/var/folders/sg/9h_lqlfd6bgb63_prv2nr4mm0000gn/T/ipykernel_4415/2649859557.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  chipotle_db['item_price'] = chipotle_db['item_price'].str.replace('$','').astype('float')

In [38]:
chipotle_db.dtypes

id                      int64
order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
dtype: object

2. What is the total price for each order?

In [39]:
chipotle_db.groupby('order_id')['item_price'].agg('sum')

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

3. What are the most popular 3 items?

In [40]:
chipotle_db['item_name'].count()

4622

In [41]:
chipotle_db.groupby('item_name')['id'].count().nlargest(3)

item_name
Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Name: id, dtype: int64

4. Which item has produced the most revenue?

In [42]:
chipotle_db.groupby('item_name')['item_price'].agg('sum').nlargest(1)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

5. Join the employees and titles DataFrames together.

In [43]:
employees_table.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [44]:
titles_table.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [45]:
emp_title = employees_table.merge(titles_table, on='emp_no')

6. For each title, find the hire date of the employee that was hired most recently with that title.

In [46]:
emp_title.groupby('title')['from_date'].agg('max')

title
Assistant Engineer    2000-02-01
Engineer              2002-08-01
Manager               1996-08-30
Senior Engineer       2002-08-01
Senior Staff          2002-08-01
Staff                 2000-02-01
Technique Leader      2000-02-01
Name: from_date, dtype: object

7. Write the code necessary to create a cross tabulation of the number of titles by department. 
(Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [47]:
cross_query = '''
    SELECT t.title, d.dept_name
    FROM dept_emp
    JOIN titles t USING(emp_no)
    JOIN departments d USING(dept_no)
    WHERE t.to_date > NOW();




'''

In [48]:

def get_db_url(host, username, password, database):
    return f'mysql+pymysql://{username}:{password}@{host}/{database}'
cross_url = get_db_url(host, username, password, 'employees')

In [49]:
df_cross = pd.read_sql(cross_query, cross_url)

df_cross.head()

             title        dept_name
0  Senior Engineer      Development
1            Staff            Sales
2  Senior Engineer       Production
3  Senior Engineer       Production
4     Senior Staff  Human Resources

In [50]:
df_cross.shape

(265332, 2)

In [51]:
pd.crosstab(df_cross['title'], df_cross['dept_name']).T

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,68,627,1,1790,12349,3902,241
Development,1833,15677,1,43364,1085,315,6117
Finance,0,0,1,0,10650,3199,0
Human Resources,0,0,1,0,10843,3416,0
Marketing,0,0,1,0,12371,3880,0
Production,1542,13325,1,37156,1123,349,5210
Quality Management,433,3744,1,10390,0,0,1422
Research,77,830,1,2250,10219,3206,321
Sales,0,0,1,0,32032,9967,0